app/controllers/developers_controller.rb

  def index
    @developers = Developer.all
---
SELECT * FROM `developers`

  def show
    @developer = Developer.find(params[:id])
---
SELECT * FROM `developers` WHERE (`developers`.`id` = 1)

  def edit
    @developer = Developer.find(params[:id])
---
SELECT * FROM `developers` WHERE (`developers`.`id` = 1)

  def update
    @developer = Developer.find(params[:id])

    respond_to do |format|
      if @developer.update_attributes(params[:developer])
---
SELECT * FROM `developers` WHERE (`developers`.`id` = 1)
UPDATE `developers` SET `updated_at` = '2010-09-11 01:27:13', `name` = 'Bungie', `created_at` = '2010-09-07 22:06:00' WHERE `id` = 1