app/controllers/games_controller.rb

  def index
    @games = Game.all

    # Mike MODIFICATION make sure these are defined in any other methods that require it to
    # render the "action -> index" view
    @publishers = Publisher.find(:all)
---
SELECT * FROM `games`
SELECT * FROM `publishers` WHERE (`publishers`.`id` = 2)

  def show
    @game = Game.find(params[:id])
---
SELECT * FROM `games` WHERE (`games`.`id` = 3)

  def edit

    # Mike MODIFICATION make sure these are defined in any other methods that require it to
    # render the "action -> edit" view
    @publishers = Publisher.find(:all)
    @platforms = Platform.find(:all)

    # STANDARD SCAFFOLD
    @game = Game.find(params[:id])
---
SELECT * FROM `games` WHERE (`games`.`id` = 3)

  def create
    @game = Game.new(params[:game])
    @platforms = Platform.find(:all)

    checked_platforms = check_platform_using(params[:platform_list])
    unchecked_missing_platforms(@platforms,checked_platforms)

    respond_to do |format|
      if @game.save
---
SELECT * FROM `platforms` WHERE (`platforms`.`id` = 1)
INSERT INTO `games` (`rating`, `price`, `category`, `created_at`, `title`, `platform_legacy`, `updated_at`, `availability`, `disc_condition`, `edition_id`, `developer_id`, `release_date`, `pre_order_date`, `image_path`, `publisher_id`, `esrb`) VALUES('9.7', 79.99, 'Shooter', '2010-09-16 02:19:00', 'Call of Duty: Black Ops', 'PS3', '2010-09-16 02:19:00', 'Pre-order Ships 11/9/2010', 'New', 4, 0, '2010-09-16 02:19:00', '2010-09-16 02:19:00', '', 3, 'RP')

  def update
    @game = Game.find(params[:id])

    checked_platforms = check_platform_using(params[:platform_list])
    unchecked_missing_platforms(@platforms,checked_platforms)

    respond_to do |format|
      if @game.update_attributes(params[:game])
        flash[:notice] = 'Game was successfully updated.'



        format.html { redirect_to(@game) }
        format.xml  { head :ok }
      else

        # Mike MODIFICATION - Update fails so this will render the edit screen again in order to try
        # the edit again. But in order to render the page edit requires a definition of @publishers
        # just like in the edit method. The following defines this.
        @publishers = Publisher.find(:all)
---
SELECT * FROM `games` WHERE (`games`.`id` = 3)
UPDATE `games` SET `updated_at` = '2010-09-20 06:33:45', `image_path` = 'xbox_360/mafia_ii.jpg', `title` = 'Mafia II' WHERE `id` = 3
SELECT * FROM `publishers` WHERE (`publishers`.`id` = 3)

  def destroy
    @game = Game.find(params[:id])
    @game.destroy
---
SELECT * FROM `games` WHERE (`games`.`id` = 5)
DELETE FROM `games` WHERE `id` = 5