app/controllers/home_controller.rb

  def add_to_cart

    # Get the game id from the url and find it so that the controller can work with it
    game_item = Game.find(params[:id])
---
SELECT `games`.* FROM `games` WHERE (`games`.`id` = 1) LIMIT 1

  def remove_from_cart
    game_item = Game.find(params[:id])
---
SELECT * FROM `games` WHERE (`games`.`id` = 3)