app/controllers/platforms_controller.rb

SELECT * FROM `platforms`
---
  def index
    @platforms = Platform.all

SELECT * FROM `platforms` WHERE (`platforms`.`id` = 1)
---
  def show
    @platform = Platform.find(params[:id])

SELECT * FROM `platforms` WHERE (`platforms`.`id` = 1)
---
  def edit
    @platform = Platform.find(params[:id])

INSERT INTO `platforms` (`name`, `created_at`, `updated_at`) VALUES('iPhone', '2010-09-16 02:03:00', '2010-09-16 02:03:00')
---
  def create
    @platform = Platform.new(params[:platform])

    respond_to do |format|
      if @platform.save

SELECT * FROM `platforms` WHERE (`platforms`.`id` = 1)
UPDATE `platforms` SET `updated_at` = '2010-09-16 06:29:44', `created_at` = '2010-09-16 06:29:00' WHERE `id` = 1
---
  def update
    @platform = Platform.find(params[:id])

    respond_to do |format|
      if @platform.update_attributes(params[:platform])