app/controllers/refresher_controller.rb

  def show
     # Lets use the URL parameters to dynamically tell the view which ID to show
     # For Example/ http://localhost:3000/public/show/6
     @game = Game.find_by_id(params['id'])
---
SELECT * FROM `games` WHERE (`games`.`id` = '2') LIMIT 1

   def edit
         # Try 'find_by_id' here to see what happens later
         @game = Game.find_by_id(params[:id])
---
SELECT * FROM `games` WHERE (`games`.`id` = '4') LIMIT 1